#+TITLE: Sistemas Estocásticos
#+SUBTITLE: Test4
#+INCLUDE: "~/org/config/config-spanish.org"
#+INCLUDE: "~/org/config/config.org"
#+DATE: Junio 2022
#+AUTHOR: Tomás Muñoz
#+AUTHOR: \\
#+AUTHOR: Manuel Fuica Morales

** a

#+begin_quote
a) ¿Qué proporción de tiempo está el
   servidor desocupado?
#+end_quote

De la materia vista en clases, la probabilidad
de encontrar 0 clientes en el sistema para un
modelo M/M/1 se calcula con:

\begin{align*}
  P_0=1-\frac{\lambda}{\mu}
\end{align*}

Contamos con los datos de entrada al
sistema \lambda=10 \(\frac{programa}{minuto}\)
y tiempo promedio de ejecución
\(\frac{1}{\mu}\) = 5 \(\frac{segundo}{programa}\).

\begin{align*}
  \frac{1}{\mu}=
  5\ \frac{segundo}{programa}
  \rightarrow
  =
  5\ \frac{1}{60}
  \frac{minuto}{\cancel{segundo}}
  \frac{\cancel{segundo}}{programa}
  \rightarrow
  12\ \frac{programa}{minuto}
\end{align*}

Por lo tanto nuestra tasa de servicio \mu
es 12 \(\frac{programa}{segundo}\).

De esta forma, la probabilidad de encontrar en
cualquier momento el sistema desocupado es:

#+name: idle_time_percentage
#+begin_src R :session :exports both :results value
input<-10
service_rate<-12
round(1-(input/service_rate),5)
#+end_src

#+RESULTS: idle_time_percentage
: 0.16667

#+name: hours
#+begin_src python :exports none :results output
hours=10
print(hours)
#+end_src

#+RESULTS: hours
: 10

Por lo tanto, se espera que de cada
call_hours() {{{results(=10=)}}}
horas que el servidor está funcionando:

#+name: idle_time_in_minutes
#+begin_src python :session :exports none :var percentage=idle_time_percentage :var hours=hours :results replace output
print(int(hours)*percentage*60)
#+end_src

#+RESULTS: idle_time_in_minutes
: 100.00200000000001

#+begin_src python :exports results :session :var input=idle_time_in_minutes :results output
time = int(float(input))
import datetime
print(datetime.timedelta(minutes=time))
#+end_src

#+RESULTS:
: 1:40:00

aproximadamente el servidor esté ocioso.

** b
:PROPERTIES:
:ID:       c50c5e40-be4a-4d05-83fb-874de1e06616
:END:

#+begin_quote
b) ¿Cuál es el tiempo esperado total de
   salida de un programa?
#+end_quote

Si consideramos el tiempo esperado total de salida
de un programa como el tiempo que le toma
esperar en la cola más el tiempo que le toma
ser procesado, entonces podemos calcular
dicho tiempo total como:

\begin{align*}
  W=\frac{1}{\mu - \lambda}
\end{align*}

#+name: total_time_percentage
#+begin_src R :session :exports :results silent
total_time=1/(service_rate-input)
#+end_src

#+RESULTS: total_time_percentage
: 0.5

#+name: total_time_in_seconds
#+begin_src python :session :results output :exports results :var total_time=total_time_percentage
print(float(total_time)*float(60))
#+end_src

#+RESULTS: total_time_in_seconds
: 30.0

Así, se espera que en promedio, cada programa
tome call_total_time_in_seconds() {{{results(=30.0=)}}}
segundos en ser procesado y ejecutado.

** c

#+begin_quote
c) ¿Cuál es el número medio de programas
   esperando en la cola del sistema?
#+end_quote

Por teoría sabemos que la cantidad
de labores promedio esperando a ser ejecutados
se calcula:

\begin{align*}
L_q=\frac{\lambda^2}{\mu (\mu - \lambda)}
\end{align*}

Luego:

#+name: labor_in_queue
#+begin_src R :session :exports both
labor_in_queue<-(input^2)/(service_rate*(service_rate-input))
#+end_src

#+RESULTS: labor_in_queue
: 4.16666666666667

#+name: labor_in_queue_approx
#+begin_src python :session :exports none :var input=labor_in_queue :results output
print(int(input))
#+end_src

#+RESULTS: labor_in_queue_approx
: 4

Por lo tanto, en un momento cualquiera
deberíamos esperar encontrarnos con
aproximadamente
call_labor_in_queue_approx() {{{results(=4=)}}}
programas en fila esperando a ser ejecutados.

** a

#+begin_quote
a) La probabilidad de que haya línea de espera.
#+end_quote

Para que haya línea de espera, implica que hay
un cliente siendo atendido y por lo menos
otro haciendo la fila, por lo que la cantidad
de individuos en el sistema es por lo menos
2:

Ésta se calcula con:

\begin{align*}
\sum_{n=2}^{\infty}P_{n}= (1-\rho) \rho^{n}
=
\sum_{n=0}^{1}P_{n}= (1-\rho) \rho^{n}
\end{align*}

donde \(\rho=\frac{\lambda}{\mu}\) se conoce
como el "factor de utilización".

#+begin_src R :session :exports code
input<-10
service_rate<-15
usage_factor<-input/service_rate
#+end_src

#+RESULTS:
: 0.666666666666667

#+name: number_of_clients_in_system
#+begin_src R :session :exports none
number_of_clients_in_system<-2
#+end_src

#+RESULTS: number_of_clients_in_system
: 2

Necesitamos saber la probabilidad de tener 2 o
más clientes:

Por lo tanto calculamos la probabilidad acumulada
de tener 0 o 1 clientes y obtenemos el complemento:

#+name: probability_of_n_clients_in_system
#+begin_src R :session :exports both :var clients=number_of_clients_in_system
clients_adjusted<-clients-1
r<-usage_factor
1-sum(probability_of_n_clients_in_system<-(1-r)*(r^(0:clients_adjusted)))
#+end_src

#+RESULTS: probability_of_n_clients_in_system
: 0.444444444444444

#+name: probability_of_n_clients_in_system_approx
#+begin_src python :session :exports none :var input=probability_of_n_clients_in_system :results output silent
input_adjusted=input*100
print(round(input_adjusted, 2))
#+end_src

#+name: hours_of_work
#+begin_src python :session :exports none :results output silent
hours_of_work=8
print(hours_of_work)
#+end_src

#+name: hours_of_queue
#+begin_src python :session :exports none :results silent output :var input=probability_of_n_clients_in_system
hours_of_work_adjusted=hours_of_work*60
input_adjusted=input*hours_of_work_adjusted
time = int(float(input_adjusted))
print(datetime.timedelta(minutes=time))
#+end_src

Por lo tanto, la probabilidad de tener 2 o
más clientes, significando que hay fila,
es de aproximadamente un
call_probability_of_n_clients_in_system_approx() {{{results(=44.44=)}}} %,
por lo que de cada
call_hours_of_work() {{{results(=8=)}}}
horas de trabajo, aproximadamente
call_hours_of_queue() {{{results(=3:33:00=)}}}
habrá gente esperando a ser atendida.

** b

#+begin_quote
b) La longitud media de la línea de espera.
#+end_quote

Esto se calcula como:

\begin{align*}
L_q=\frac{\lambda^2}{\mu(\mu-\lambda)}
\end{align*}

Todos estos datos ya los conocemos por lo que:

#+name: mean_labors_in_queue
#+begin_src R :session :exports both
mean_labors_in_queue<-input^2 / (service_rate * (service_rate - input))
#+end_src

#+RESULTS: mean_labors_in_queue
: 1.33333333333333

#+name: mean_labors_in_queue_rounded
#+begin_src python :session :results output :var input=mean_labors_in_queue :exports none :results silent
print(int(float(input)))
#+end_src

Lo que significa que en promedio, la
fila tendrá
call_mean_labors_in_queue_rounded() {{{results(=1=)}}}
personas.

** b

#+begin_quote
2) [@2] Tamaño medio de la cola y probabilidad
   de que al acudir al cajero ya haya
   alguna persona en la cola.
#+end_quote

En cuanto al tamaño medio:

- Esto se calcula de la forma:
\begin{align*}
L_q=\frac{\lambda^2}{\mu (\mu - \lambda)}
\end{align*}

Luego:

#+name: labor_in_queue_4
#+begin_src R :session :exports both
labor_in_queue<-(input^2)/(service_rate*(service_rate - input))
#+end_src

#+RESULTS: labor_in_queue_4
: 1.33333333333333

#+name: labor_in_queue_approx_4
#+begin_src python :session :exports none :var input=labor_in_queue_4 :results silent output
print(round(input))
#+end_src

Por lo tanto, en un momento cualquiera
deberíamos esperar encontrarnos con
aproximadamente
call_labor_in_queue_approx_4()
personas en fila esperando a ser atendidos.

-----

- En cuanto a la probabilidad que cuando llegue una
  persona, ya exista otra haciendo la fila:


Para que haya línea de espera, implica que hay
un cliente siendo atendido y por lo menos
otro haciendo la fila, por lo que la cantidad
de individuos en el sistema es por lo menos
2:

Ésta se calcula con:

\begin{align*}
\sum_{n=2}^{\infty}P_{n}= (1-\rho) \rho^{n}
=
\sum_{n=0}^{1}P_{n}= (1-\rho) \rho^{n}
\end{align*}

donde \(\rho=\frac{\lambda}{\mu}\) se conoce
como el "factor de utilización".

#+begin_src R :session :exports code :results silent
usage_factor<-input/service_rate
#+end_src

#+name: number_of_clients_in_system_4
#+begin_src R :session :exports none :results silent
number_of_clients_in_system<-2
#+end_src

Necesitamos saber la probabilidad de tener 2 o
más clientes:

Por lo tanto calculamos la probabilidad acumulada
de tener 0 o 1 clientes y obtenemos el complemento:

#+name: probability_of_n_clients_in_system_4
#+begin_src R :session :exports both :var clients=number_of_clients_in_system_4 :results value
clients_adjusted<-clients-1
r<-usage_factor
prob_cum_of_n_clients_in_system<-sum((1-r)*(r^(0:clients_adjusted)))
prob_cum<-prob_cum_of_n_clients_in_system
round((1-prob_cum),5)
#+end_src

#+RESULTS: probability_of_n_clients_in_system_4
: 0.44444

#+name: probability_of_n_clients_in_system_approx_4
#+begin_src python :session :exports none :var input=probability_of_n_clients_in_system_4 :results output silent
input_adjusted=input*100
print(round(input_adjusted, 2))
#+end_src

#+name: times_you_go_to_ATM_4
#+begin_src python :session :exports none :results output silent
times_you_go_to_ATM_4=5
print(times_you_go_to_ATM_4)
#+end_src

#+name: probability_of_n_clients_in_system_approx_no_decimals_4
#+begin_src python :session :exports none :var input=probability_of_n_clients_in_system_4 :results output silent
input_adjusted=input*int(times_you_go_to_ATM_4)
print(round(input_adjusted))
#+end_src

Por lo tanto, la probabilidad de que al
acudir en cualquier momento
al cajero nos encontremos con una fila
es de aproximadamente un
call_probability_of_n_clients_in_system_approx_4() %.

Por lo que de cada
call_times_you_go_to_ATM_4()
veces que visitamos el
cajero,
call_probability_of_n_clients_in_system_approx_no_decimals_4()
veces nos encontramos con una fila.

** Desarrollo

Este escenario se acomoda a un modelo M/M/1 dado
que:

- La entrada y servicio ocurren según un
  proceso de Poisson.
- Hay solo una torre que va dando las ordenes
  de aterrizaje; por lo tanto cuenta como
  un solo servidor.
- No se indica que hayan otras opciones de
  aterrizaje para los aviones, por lo que
  se asume que los aviones simplemente
  tienen que esperar su turno sin más opción.


- Tasa de servicio: en este caso hace referencia
  al tiempo que toma en aterrizar a partir
  del momento en que la torre da la señal
  de aterrizaje.


\begin{align*}
\frac{1}{\mu}= 4\ \frac{minuto}{aterrizaje}
\rightarrow
\frac{1}{4}\frac{aterrizaje}{minuto}=\mu
\end{align*}

- Tasa de entrada:


\begin{align*}
\lambda=8\ \frac{aterrizaje}{\cancel{hora}}
\frac{\cancel{hora}}{minuto}
\frac{1}{60}
\rightarrow
\frac{8}{60}
\frac{aterrizaje}{minuto}=\lambda
\end{align*}


Declaramos las variables en el sistema:

#+name: init_5
#+begin_src R :session :exports code :results silent
service_rate<-(1/4)
input<-(8/60)
#+end_src

#+begin_quote
¿cuánto va a
esperar el piloto dando vueltas al
aeropuerto antes de recibir la señal
de tierra?
#+end_quote

El tiempo de espera promedio para
un modelo M/M/1 se calcula:

\begin{align*}
W_q=\frac{\lambda}{\mu(\mu - \lambda)}
\end{align*}

#+name: mean_wait_in_queue_5
#+begin_src R :session :results replace value :exports both
i<-input
s<-service_rate
mean_wait_in_queue_5<-i/(s *(s - i))
mean_wait_in_queue_5_rounded<-round(mean_wait_in_queue_5,5)
#+end_src

#+RESULTS: mean_wait_in_queue_5
: 4.57143

#+name: mean_wait_in_queue_approx_5
#+begin_src python :exports none :results silent output :var input=mean_wait_in_queue_5
time = round(float(input),1)
print(datetime.timedelta(minutes=time))
#+end_src

Por lo que en promedio, cada avión deberá
esperar aproximadamente
call_mean_wait_in_queue_approx_5()
antes de empezar el proceso de aterrizaje.

